#include "main.h"

BSDATA(landscapei) = {
	{"AsteroidFields", "Поле астероидов", "Все космическое пространство покрыто спутниками и астероидами различного размера.", {"station"}},
	{"TerrainRealm", "Горы и океаны", "Планета содаржит океаны, моря, равнины и горы. Есть пригодная для жихни атмосфера.", {"102", "103", "104", "105", "106", "107", "108", "109", "110", "111", "112"}},
	{"ColdRealm", "Снежные пустоши", "Вся планета покрыта льдом.", {"211", "212", "213", "214", "300"}},
	{"SandRealm", "Песчаные дюны", "Планета в основном состоит из пустыни, местами переходящей в каменистые плато. Вода практически отсутствует.", {"200", "202", "206", "207"}},
	{"WaterRealm", "Огромный океан", "Вся планета покрыта огромным океаном. Встречаются мелкие острова.", {"100", "101", "102"}},
	{"GasGiant", "Газовый гигант", "Планета целиком и полностью состоит из газа.", {"115", "116", "117", "118"}},
	{"FoggyJungles", "Туманные джунгли", "Планета содержит горы и океаны, но в основном покрыта экзотической растительностью и болотами.", {"108", "103"}},
	{"RockyRealm", "Скалы и горы", "Поверхность планеты покрыта высокими горными массивами.", {"112", "203", "204", "205", "301", "302", "303", "304", "305", "306", "307", "308", "309", "310", "312", "313"}},
	{"CorrosiveHell", "Вулканы и лава", "На поверхности планеты разливается лава, которая застывает в ночное время.", {"314", "315", "316", "317", "318"}},
};
assert_enum(landscapei, CorrosiveHell)

const char* landscapei::getbackground(unsigned seed) const {
	auto maximum = background.size();
	if(!maximum)
		return "107";
	return *(background.begin() + seed % maximum);
}