#include "main.h"

BSDATA(protoshipi) = {
	{"Zond", "Зонд", 0, 10},
	{"Capsule", "Капсула", 1, 20, 40},
	{"Shuttle", "Шаттл", 1, 60, 50},
	{"Fighter", "Истребитель", 1, 100, 100},
	{"Ranger", "Рейнджер", 3, 250, 60},
	{"Interceptor", "Налетчик", 6, 250, 140},
	{"Battleship", "Штурмовик", 10, 400, 80},
	{"Transporter", "Транспорт", 6, 400, 60},
	{"Cruiser", "Крейсер", 50, 600, 80},
	{"Carrier", "Авианосец", 50, 800, 50},
	{"Linkor", "Линкор", 100, 900, 40},
	{"Dreadnought", "Уничтожитель", 1000, 1300, 40},
	{"Station", "Станция", 10000, 5000, 30},
};